wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rcu.h
/* peripherals reset */
typedef enum {
    /* AHB1 peripherals */
    RCU_ENET1RST     = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 0U),                      /*!< ENET1 reset */
    RCU_USBHS0RST    = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 14U),                     /*!< USBHS0 reset */
    RCU_DMA0RST      = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 21U),                     /*!< DMA0 reset */
    RCU_DMA1RST      = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 22U),                     /*!< DMA1 reset */
    RCU_DMAMUXRST    = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 23U),                     /*!< DMAMUX reset */
    RCU_ENET0RST     = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 25U),                     /*!< ENET reset */
    RCU_USBHS1RST    = RCU_REGIDX_BIT(AHB1RST_REG_OFFSET, 29U),                     /*!< USBHS1HS reset */
    /* AHB2 peripherals */
    RCU_DCIRST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 0U),                      /*!< DCI and GPSI reset */
    RCU_FACRST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 1U),                      /*!< FAC reset */
    RCU_SDIO1RST     = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 2U),                      /*!< SDIO1 reset */
    RCU_CAURST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 3U),                      /*!< CAU reset */
    RCU_HAURST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 4U),                      /*!< HAU reset */
    RCU_TRNGRST      = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 6U),                      /*!< TRNG reset */
    RCU_TMURST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 7U),                      /*!< TMU reset */
    RCU_PKCAURST     = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 9U),                      /*!< PKCAU reset */
    RCU_FFTRST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 10U),                     /*!< FFT reset */
    RCU_ESCRST       = RCU_REGIDX_BIT(AHB2RST_REG_OFFSET, 12U),                     /*!< ESC reset */
    /* AHB3 peripherals */
    RCU_EXMCRST      = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 0U),                      /*!< EXMC reset */
    RCU_IPARST       = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 1U),                      /*!< IPA reset */
    RCU_SDIO0RST     = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 2U),                      /*!< SDIO0 reset */
    RCU_MDMARST      = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 3U),                      /*!< MDMMA reset */
    RCU_OSPIMRST     = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 4U),                      /*!< OSPIM reset */
    RCU_OSPI0RST     = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 5U),                      /*!< OSPI0 reset */
    RCU_OSPI1RST     = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 6U),                      /*!< OSPI1 reset */
    RCU_DSIRST       = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 7U),                      /*!< DSI reset */
    RCU_RTDEC0RST    = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 8U),                      /*!< RTDEC0 reset */
    RCU_RTDEC1RST    = RCU_REGIDX_BIT(AHB3RST_REG_OFFSET, 9U),                      /*!< RTDEC1 reset */
    /* AHB4 peripherals */
    RCU_GPIOARST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 0U),                      /*!< GPIOA reset */
    RCU_GPIOBRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 1U),                      /*!< GPIOB reset */
    RCU_GPIOCRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 2U),                      /*!< GPIOC reset */
    RCU_GPIODRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 3U),                      /*!< GPIOD reset */
    RCU_GPIOERST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 4U),                      /*!< GPIOE reset */
    RCU_GPIOFRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 5U),                      /*!< GPIOF reset */
    RCU_GPIOGRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 6U),                      /*!< GPIOG reset */
    RCU_GPIOHRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 7U),                      /*!< GPIOH reset */
    RCU_GPIOJRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 8U),                      /*!< GPIOJ reset */
    RCU_GPIOKRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 9U),                      /*!< GPIOK reset */
    RCU_CRCRST       = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 14U),                     /*!< CRC reset */
    RCU_HWSEMRST     = RCU_REGIDX_BIT(AHB4RST_REG_OFFSET, 15U),                     /*!< HWSEM reset */
    /* APB1 peripherals */
    RCU_TIMER1RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 0U),                      /*!< TIMER1 reset */
    RCU_TIMER2RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 1U),                      /*!< TIMER2 reset */
    RCU_TIMER3RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 2U),                      /*!< TIMER3 reset */
    RCU_TIMER4RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 3U),                      /*!< TIMER4 reset */
    RCU_TIMER5RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 4U),                      /*!< TIMER5 reset */
    RCU_TIMER6RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 5U),                      /*!< TIMER6 reset */
    RCU_TIMER22RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 6U),                      /*!< TIMER22 reset */
    RCU_TIMER23RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 7U),                      /*!< TIMER23 reset */
    RCU_TIMER30RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 8U),                      /*!< TIMER30 reset */
    RCU_TIMER31RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 9U),                      /*!< TIMER31 reset */
    RCU_TIMER50RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 10U),                     /*!< TIMER50 reset */
    RCU_TIMER51RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 11U),                     /*!< TIMER51 reset */
    RCU_RSPDIFRST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 13U),                     /*!< RSPDIF reset */
    RCU_SPI1RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 14U),                     /*!< SPI1 reset */
    RCU_SPI2RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 15U),                     /*!< SPI2 reset */
    RCU_MDIORST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 16U),                     /*!< MDIO reset */
    RCU_USART1RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 17U),                     /*!< USART1 reset */
    RCU_USART2RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 18U),                     /*!< USART2 reset */
    RCU_UART3RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 19U),                     /*!< UART3 reset */
    RCU_UART4RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 20U),                     /*!< UART4 reset */
    RCU_I2C0RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 21U),                     /*!< I2C0 reset */
    RCU_I2C1RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 22U),                     /*!< I2C1 reset */
    RCU_I2C2RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 23U),                     /*!< I2C2 reset */
    RCU_I2C3RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 24U),                     /*!< I2C3 reset */
    RCU_CTCRST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 27U),                     /*!< CTC reset */
    RCU_DACHOLDRST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 28U),                     /*!< DACHOLD reset */
    RCU_DACRST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 29U),                     /*!< DAC reset */
    RCU_UART6RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 30U),                     /*!< UART6 reset */
    RCU_UART7RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 31U),                     /*!< UART7 reset */
    /* APB2 peripherals */
    RCU_TIMER0RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 0U),                      /*!< TIMER0 reset */
    RCU_TIMER7RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 1U),                      /*!< TIMER7 reset */
    RCU_USART0RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 4U),                      /*!< USART0 reset */
    RCU_USART5RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 5U),                      /*!< USART5 reset */
    RCU_ADC0RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 8U),                      /*!< ADC0 reset */
    RCU_ADC1RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 9U),                      /*!< ADC1 reset */
    RCU_ADC2RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 10U),                     /*!< ADC2 reset */
    RCU_SPI0RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 12U),                     /*!< SPI0 reset */
    RCU_SPI3RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 13U),                     /*!< SPI3 reset */
    RCU_SAI3RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 15U),                     /*!< SAI3 reset */
    RCU_TIMER14RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 16U),                     /*!< TIMER14 reset */
    RCU_TIMER15RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 17U),                     /*!< TIMER15 reset */
    RCU_TIMER16RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 18U),                     /*!< TIMER16 reset */
    RCU_HPDFRST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 19U),                     /*!< HPDF reset */
    RCU_SPI4RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 20U),                     /*!< SPI4 reset */
    RCU_SPI5RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 21U),                     /*!< SPI5 reset */
    RCU_SAI0RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 22U),                     /*!< SAI0 reset */
    RCU_SAI1RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 23U),                     /*!< SAI1 reset */
    RCU_SAI2RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 24U),                     /*!< SAI2 reset */
    RCU_TIMER40RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 25U),                     /*!< TIMER40 reset */
    RCU_TIMER41RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 26U),                     /*!< TIMER41 reset */
    RCU_TIMER42RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 27U),                     /*!< TIMER42 reset */
    RCU_TIMER43RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 28U),                     /*!< TIMER43 reset */
    RCU_TIMER44RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 29U),                     /*!< TIMER44 reset */
    RCU_EDOUTRST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 30U),                     /*!< EDOUT reset */
    RCU_TRIGSELRST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 31U),                     /*!< TRIGSEL reset */
    /* APB3 peripherals */
    RCU_TLIRST       = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 0U),                      /*!< TLI reset */
    RCU_WWDGTRST     = RCU_REGIDX_BIT(APB3RST_REG_OFFSET, 1U),                      /*!< WWDGT reset */
    /* APB4 peripherals */
    RCU_SYSCFGRST    = RCU_REGIDX_BIT(APB4RST_REG_OFFSET, 0U),                      /*!< SYSCFG reset */
    RCU_CMPRST       = RCU_REGIDX_BIT(APB4RST_REG_OFFSET, 1U),                      /*!< CMP reset */
    RCU_VREFRST      = RCU_REGIDX_BIT(APB4RST_REG_OFFSET, 2U),                      /*!< VREF reset */
    RCU_LPDTSRST     = RCU_REGIDX_BIT(APB4RST_REG_OFFSET, 3U),                      /*!< LPDTS reset */
    RCU_PMURST       = RCU_REGIDX_BIT(APB4RST_REG_OFFSET, 4U),                      /*!< PMU reset */
    /* APB2 additional peripherals */
    RCU_CAN0RST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 0U),                  /*!< CAN0 reset */
    RCU_CAN1RST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 1U),                  /*!< CAN1 reset */
    RCU_CAN2RST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 2U),                  /*!< CAN2 reset */
    RCU_AFMTRST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 16U),                 /*!< AFMT reset */
    RCU_TFMTRST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 17U),                 /*!< TFMT reset */
    RCU_ENDATRST     = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 18U),                 /*!< ENDAT reset */
    RCU_BISSRST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 19U),                 /*!< BISS reset */
    RCU_HDSLRST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 20U),                 /*!< HDSL reset */
    RCU_RDCMRST      = RCU_REGIDX_BIT(ADD_APB2RST_REG_OFFSET, 21U)                  /*!< RDCM reset */
} rcu_periph_reset_enum;

/* clock stabilization and failure, peripheral reset and clock frequency failure flags */
typedef enum {
    /* clock stabilization flags */
    RCU_FLAG_IRC64MSTB     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 31U),                   /*!< IRC64M stabilization flag */
    RCU_FLAG_HXTALSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 17U),                   /*!< HXTAL stabilization flag */
    RCU_FLAG_PLL0STB       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),                   /*!< PLL0 stabilization flag */
    RCU_FLAG_PLL1STB       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 27U),                   /*!< PLL1 stabilization flag */
    RCU_FLAG_PLL2STB       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 29U),                   /*!< PLL2 stabilization flag */
    RCU_FLAG_LXTALSTB      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 1U),                  /*!< LXTAL stabilization flag */
    RCU_FLAG_IRC32KSTB     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),                 /*!< IRC32K stabilization flag */
    RCU_FLAG_IRC48MSTB     = RCU_REGIDX_BIT(ADDCTL0_REG_OFFSET, 17U),               /*!< IRC48M stabilization flag */
    RCU_FLAG_LPIRC4MSTB    = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 1U),                /*!< LPIRC4M stabilization flag */
    RCU_FLAG_PLLUSBHS0STB  = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 29U),               /*!< PLLUSBHS0 stabilization flag */
    /* clock failure flag */
    RCU_FLAG_LCKMD         = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 6U),                  /*!< LXTAL clock failure detection flag */
    /* reset source flags */
    RCU_FLAG_BORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 25U),                /*!< BOR reset flag */
    RCU_FLAG_EPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),                /*!< External PIN reset flag */
    RCU_FLAG_PORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),                /*!< power reset flag */
    RCU_FLAG_SWRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),                /*!< Software reset flag */
    RCU_FLAG_FWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),                /*!< FWDGT reset flag */
    RCU_FLAG_WWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),                /*!< WWDGT reset flag */
    RCU_FLAG_LPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U),                /*!< low-power reset flag */
    /* clock frequency failure flags */
    RCU_FLAG_IRC64MCKFF    = RCU_REGIDX_BIT(CKFMCFG0_REG_OFFSET, 3U),               /*!< IRC64M clock frequency failure flag */
    RCU_FLAG_LPIRC4MCKFF   = RCU_REGIDX_BIT(CKFMCFG0_REG_OFFSET, 19U),              /*!< LPIRC4M clock frequency failure flag */
    RCU_FLAG_HXTALCKFF     = RCU_REGIDX_BIT(CKFMCFG1_REG_OFFSET, 30U),              /*!< HXTAL clock frequency failure flag */
    RCU_FLAG_PLL0PCKFF     = RCU_REGIDX_BIT(CKFMCFG2_REG_OFFSET, 30U)               /*!< PLL0P clock frequency failure flag */
} rcu_flag_enum;

/* clock stabilization and stuck interrupt flags */
typedef enum {
    RCU_INT_FLAG_IRC32KSTB      = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),               /*!< IRC32K stabilization interrupt flag */
    RCU_INT_FLAG_LXTALSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),               /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_IRC64MSTB      = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),               /*!< IRC64M stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),               /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLL0STB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),               /*!< PLL0 stabilization interrupt flag */
    RCU_INT_FLAG_PLL1STB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 5U),               /*!< PLL1 stabilization interrupt flag */
    RCU_INT_FLAG_PLL2STB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 6U),               /*!< PLL2 stabilization interrupt flag */
    RCU_INT_FLAG_CKM            = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),               /*!< HXTAL clock stuck interrupt flag */
    RCU_INT_FLAG_LCKM           = RCU_REGIDX_BIT(INT_REG_OFFSET, 27U),              /*!< LXTAL clock stuck interrupt flag */
    RCU_INT_FLAG_LPIRC4MSTB     = RCU_REGIDX_BIT(INT_REG_OFFSET, 24U),              /*!< LPIRC4M stabilization interrupt flag */
    RCU_INT_FLAG_IRC48MSTB      = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 6U),            /*!< IRC48M stabilization interrupt flag */
    RCU_INT_FLAG_PLLUSBHS0STB   = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 4U),            /*!< PLLUSBHS0 stabilization interrupt flag */
} rcu_int_flag_enum;

