wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rcu.h
/* system clock source select */
#define CFG0_SCS(regval)             (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_CKSYSSRC_IRC64MDIV       CFG0_SCS(0)                                    /*!< system clock source select IRC64MDIV */
#define RCU_CKSYSSRC_HXTAL           CFG0_SCS(1)                                    /*!< system clock source select HXTAL */
#define RCU_CKSYSSRC_LPIRC4M         CFG0_SCS(2)                                    /*!< system clock source select LPIRC4M */
#define RCU_CKSYSSRC_PLL0P           CFG0_SCS(3)                                    /*!< system clock source select PLL0P */

/* system clock source select status */
#define CFG0_SCSS(regval)            (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_SCSS_IRC64MDIV           CFG0_SCSS(0)                                   /*!< system clock source select CK_IRC64MDIV */
#define RCU_SCSS_HXTAL               CFG0_SCSS(1)                                   /*!< system clock source select CK_HXTAL */
#define RCU_SCSS_LPIRC4M             CFG0_SCSS(2)                                   /*!< system clock source select CK_LPIRC4M */
#define RCU_SCSS_PLL0P               CFG0_SCSS(3)                                   /*!< system clock source select CK_PLL0P */

/* IRC64M clock divider */
#define ADDCTL1_IRC64MDIV(regval)    (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define RCU_IRC64M_DIV1              ADDCTL1_IRC64MDIV(0)                           /*!< CK_IRC64MDIV is CK_IRC64M / 1 */
#define RCU_IRC64M_DIV2              ADDCTL1_IRC64MDIV(1)                           /*!< CK_IRC64MDIV is CK_IRC64M / 2 */
#define RCU_IRC64M_DIV4              ADDCTL1_IRC64MDIV(2)                           /*!< CK_IRC64MDIV is CK_IRC64M / 4 */
#define RCU_IRC64M_DIV8              ADDCTL1_IRC64MDIV(3)                           /*!< CK_IRC64MDIV is CK_IRC64M / 8 */

/* AHB prescaler selection */
#define CFG0_AHBPSC(regval)          (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define RCU_AHB_CKSYS_DIV1           CFG0_AHBPSC(0)                                 /*!< AHB prescaler select CK_SYS */
#define RCU_AHB_CKSYS_DIV2           CFG0_AHBPSC(8)                                 /*!< AHB prescaler select CK_SYS / 2 */
#define RCU_AHB_CKSYS_DIV4           CFG0_AHBPSC(9)                                 /*!< AHB prescaler select CK_SYS / 4 */
#define RCU_AHB_CKSYS_DIV8           CFG0_AHBPSC(10)                                /*!< AHB prescaler select CK_SYS / 8 */
#define RCU_AHB_CKSYS_DIV16          CFG0_AHBPSC(11)                                /*!< AHB prescaler select CK_SYS / 16 */
#define RCU_AHB_CKSYS_DIV64          CFG0_AHBPSC(12)                                /*!< AHB prescaler select CK_SYS / 64 */
#define RCU_AHB_CKSYS_DIV128         CFG0_AHBPSC(13)                                /*!< AHB prescaler select CK_SYS / 128 */
#define RCU_AHB_CKSYS_DIV256         CFG0_AHBPSC(14)                                /*!< AHB prescaler select CK_SYS / 256 */
#define RCU_AHB_CKSYS_DIV512         CFG0_AHBPSC(15)                                /*!< AHB prescaler select CK_SYS / 512 */

/* APB1 prescaler selection */
#define CFG0_APB1PSC(regval)         (BITS(10,12) & ((uint32_t)(regval) << 10U))
#define RCU_APB1_CKAHB_DIV1          CFG0_APB1PSC(0)                                /*!< APB1 prescaler select CK_AHB */
#define RCU_APB1_CKAHB_DIV2          CFG0_APB1PSC(4)                                /*!< APB1 prescaler select CK_AHB / 2 */
#define RCU_APB1_CKAHB_DIV4          CFG0_APB1PSC(5)                                /*!< APB1 prescaler select CK_AHB / 4 */
#define RCU_APB1_CKAHB_DIV8          CFG0_APB1PSC(6)                                /*!< APB1 prescaler select CK_AHB / 8 */
#define RCU_APB1_CKAHB_DIV16         CFG0_APB1PSC(7)                                /*!< APB1 prescaler select CK_AHB / 16 */

/* APB2 prescaler selection */
#define CFG0_APB2PSC(regval)         (BITS(13,15) & ((uint32_t)(regval) << 13U))
#define RCU_APB2_CKAHB_DIV1          CFG0_APB2PSC(0)                                /*!< APB2 prescaler select CK_AHB */
#define RCU_APB2_CKAHB_DIV2          CFG0_APB2PSC(4)                                /*!< APB2 prescaler select CK_AHB / 2 */
#define RCU_APB2_CKAHB_DIV4          CFG0_APB2PSC(5)                                /*!< APB2 prescaler select CK_AHB / 4 */
#define RCU_APB2_CKAHB_DIV8          CFG0_APB2PSC(6)                                /*!< APB2 prescaler select CK_AHB / 8 */
#define RCU_APB2_CKAHB_DIV16         CFG0_APB2PSC(7)                                /*!< APB2 prescaler select CK_AHB / 16 */

/* APB3 prescaler selection */
#define CFG0_APB3PSC(regval)         (BITS(27,29) & ((uint32_t)(regval) << 27U))
#define RCU_APB3_CKAHB_DIV1          CFG0_APB3PSC(0)                                /*!< APB3 prescaler select CK_AHB */
#define RCU_APB3_CKAHB_DIV2          CFG0_APB3PSC(4)                                /*!< APB3 prescaler select CK_AHB / 2 */
#define RCU_APB3_CKAHB_DIV4          CFG0_APB3PSC(5)                                /*!< APB3 prescaler select CK_AHB / 4 */
#define RCU_APB3_CKAHB_DIV8          CFG0_APB3PSC(6)                                /*!< APB3 prescaler select CK_AHB / 8 */
#define RCU_APB3_CKAHB_DIV16         CFG0_APB3PSC(7)                                /*!< APB3 prescaler select CK_AHB / 16 */

/* APB4 prescaler selection */
#define CFG0_APB4PSC(regval)         (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_APB4_CKAHB_DIV1          CFG0_APB4PSC(0)                                /*!< APB4 prescaler select CK_AHB */
#define RCU_APB4_CKAHB_DIV2          CFG0_APB4PSC(4)                                /*!< APB4 prescaler select CK_AHB / 2 */
#define RCU_APB4_CKAHB_DIV4          CFG0_APB4PSC(5)                                /*!< APB4 prescaler select CK_AHB / 4 */
#define RCU_APB4_CKAHB_DIV8          CFG0_APB4PSC(6)                                /*!< APB4 prescaler select CK_AHB / 8 */
#define RCU_APB4_CKAHB_DIV16         CFG0_APB4PSC(7)                                /*!< APB4 prescaler select CK_AHB / 16 */

/* RTC clock divider factor from HXTAL clock */
#define CFG0_RTCDIV(regval)          (BITS(16,21) & ((uint32_t)(regval) << 16U))
#define RCU_RTC_HXTAL_NONE           CFG0_RTCDIV(0)                                 /*!< no clock for RTC */
#define RCU_RTC_HXTAL_DIV2           CFG0_RTCDIV(2)                                 /*!< RTCDIV clock select CK_HXTAL / 2 */
#define RCU_RTC_HXTAL_DIV3           CFG0_RTCDIV(3)                                 /*!< RTCDIV clock select CK_HXTAL / 3 */
#define RCU_RTC_HXTAL_DIV4           CFG0_RTCDIV(4)                                 /*!< RTCDIV clock select CK_HXTAL / 4 */
#define RCU_RTC_HXTAL_DIV5           CFG0_RTCDIV(5)                                 /*!< RTCDIV clock select CK_HXTAL / 5 */
#define RCU_RTC_HXTAL_DIV6           CFG0_RTCDIV(6)                                 /*!< RTCDIV clock select CK_HXTAL / 6 */
#define RCU_RTC_HXTAL_DIV7           CFG0_RTCDIV(7)                                 /*!< RTCDIV clock select CK_HXTAL / 7 */
#define RCU_RTC_HXTAL_DIV8           CFG0_RTCDIV(8)                                 /*!< RTCDIV clock select CK_HXTAL / 8 */
#define RCU_RTC_HXTAL_DIV9           CFG0_RTCDIV(9)                                 /*!< RTCDIV clock select CK_HXTAL / 9 */
#define RCU_RTC_HXTAL_DIV10          CFG0_RTCDIV(10)                                /*!< RTCDIV clock select CK_HXTAL / 10 */
#define RCU_RTC_HXTAL_DIV11          CFG0_RTCDIV(11)                                /*!< RTCDIV clock select CK_HXTAL / 11 */
#define RCU_RTC_HXTAL_DIV12          CFG0_RTCDIV(12)                                /*!< RTCDIV clock select CK_HXTAL / 12 */
#define RCU_RTC_HXTAL_DIV13          CFG0_RTCDIV(13)                                /*!< RTCDIV clock select CK_HXTAL / 13 */
#define RCU_RTC_HXTAL_DIV14          CFG0_RTCDIV(14)                                /*!< RTCDIV clock select CK_HXTAL / 14 */
#define RCU_RTC_HXTAL_DIV15          CFG0_RTCDIV(15)                                /*!< RTCDIV clock select CK_HXTAL / 15 */
#define RCU_RTC_HXTAL_DIV16          CFG0_RTCDIV(16)                                /*!< RTCDIV clock select CK_HXTAL / 16 */
#define RCU_RTC_HXTAL_DIV17          CFG0_RTCDIV(17)                                /*!< RTCDIV clock select CK_HXTAL / 17 */
#define RCU_RTC_HXTAL_DIV18          CFG0_RTCDIV(18)                                /*!< RTCDIV clock select CK_HXTAL / 18 */
#define RCU_RTC_HXTAL_DIV19          CFG0_RTCDIV(19)                                /*!< RTCDIV clock select CK_HXTAL / 19 */
#define RCU_RTC_HXTAL_DIV20          CFG0_RTCDIV(20)                                /*!< RTCDIV clock select CK_HXTAL / 20 */
#define RCU_RTC_HXTAL_DIV21          CFG0_RTCDIV(21)                                /*!< RTCDIV clock select CK_HXTAL / 21 */
#define RCU_RTC_HXTAL_DIV22          CFG0_RTCDIV(22)                                /*!< RTCDIV clock select CK_HXTAL / 22 */
#define RCU_RTC_HXTAL_DIV23          CFG0_RTCDIV(23)                                /*!< RTCDIV clock select CK_HXTAL / 23 */
#define RCU_RTC_HXTAL_DIV24          CFG0_RTCDIV(24)                                /*!< RTCDIV clock select CK_HXTAL / 24 */
#define RCU_RTC_HXTAL_DIV25          CFG0_RTCDIV(25)                                /*!< RTCDIV clock select CK_HXTAL / 25 */
#define RCU_RTC_HXTAL_DIV26          CFG0_RTCDIV(26)                                /*!< RTCDIV clock select CK_HXTAL / 26 */
#define RCU_RTC_HXTAL_DIV27          CFG0_RTCDIV(27)                                /*!< RTCDIV clock select CK_HXTAL / 27 */
#define RCU_RTC_HXTAL_DIV28          CFG0_RTCDIV(28)                                /*!< RTCDIV clock select CK_HXTAL / 28 */
#define RCU_RTC_HXTAL_DIV29          CFG0_RTCDIV(29)                                /*!< RTCDIV clock select CK_HXTAL / 29 */
#define RCU_RTC_HXTAL_DIV30          CFG0_RTCDIV(30)                                /*!< RTCDIV clock select CK_HXTAL / 30 */
#define RCU_RTC_HXTAL_DIV31          CFG0_RTCDIV(31)                                /*!< RTCDIV clock select CK_HXTAL / 31 */
#define RCU_RTC_HXTAL_DIV32          CFG0_RTCDIV(32)                                /*!< RTCDIV clock select CK_HXTAL / 32 */
#define RCU_RTC_HXTAL_DIV33          CFG0_RTCDIV(33)                                /*!< RTCDIV clock select CK_HXTAL / 33 */
#define RCU_RTC_HXTAL_DIV34          CFG0_RTCDIV(34)                                /*!< RTCDIV clock select CK_HXTAL / 34 */
#define RCU_RTC_HXTAL_DIV35          CFG0_RTCDIV(35)                                /*!< RTCDIV clock select CK_HXTAL / 35 */
#define RCU_RTC_HXTAL_DIV36          CFG0_RTCDIV(36)                                /*!< RTCDIV clock select CK_HXTAL / 36 */
#define RCU_RTC_HXTAL_DIV37          CFG0_RTCDIV(37)                                /*!< RTCDIV clock select CK_HXTAL / 37 */
#define RCU_RTC_HXTAL_DIV38          CFG0_RTCDIV(38)                                /*!< RTCDIV clock select CK_HXTAL / 38 */
#define RCU_RTC_HXTAL_DIV39          CFG0_RTCDIV(39)                                /*!< RTCDIV clock select CK_HXTAL / 39 */
#define RCU_RTC_HXTAL_DIV40          CFG0_RTCDIV(40)                                /*!< RTCDIV clock select CK_HXTAL / 40 */
#define RCU_RTC_HXTAL_DIV41          CFG0_RTCDIV(41)                                /*!< RTCDIV clock select CK_HXTAL / 41 */
#define RCU_RTC_HXTAL_DIV42          CFG0_RTCDIV(42)                                /*!< RTCDIV clock select CK_HXTAL / 42 */
#define RCU_RTC_HXTAL_DIV43          CFG0_RTCDIV(43)                                /*!< RTCDIV clock select CK_HXTAL / 43 */
#define RCU_RTC_HXTAL_DIV44          CFG0_RTCDIV(44)                                /*!< RTCDIV clock select CK_HXTAL / 44 */
#define RCU_RTC_HXTAL_DIV45          CFG0_RTCDIV(45)                                /*!< RTCDIV clock select CK_HXTAL / 45 */
#define RCU_RTC_HXTAL_DIV46          CFG0_RTCDIV(46)                                /*!< RTCDIV clock select CK_HXTAL / 46 */
#define RCU_RTC_HXTAL_DIV47          CFG0_RTCDIV(47)                                /*!< RTCDIV clock select CK_HXTAL / 47 */
#define RCU_RTC_HXTAL_DIV48          CFG0_RTCDIV(48)                                /*!< RTCDIV clock select CK_HXTAL / 48 */
#define RCU_RTC_HXTAL_DIV49          CFG0_RTCDIV(49)                                /*!< RTCDIV clock select CK_HXTAL / 49 */
#define RCU_RTC_HXTAL_DIV50          CFG0_RTCDIV(50)                                /*!< RTCDIV clock select CK_HXTAL / 50 */
#define RCU_RTC_HXTAL_DIV51          CFG0_RTCDIV(51)                                /*!< RTCDIV clock select CK_HXTAL / 51 */
#define RCU_RTC_HXTAL_DIV52          CFG0_RTCDIV(52)                                /*!< RTCDIV clock select CK_HXTAL / 52 */
#define RCU_RTC_HXTAL_DIV53          CFG0_RTCDIV(53)                                /*!< RTCDIV clock select CK_HXTAL / 53 */
#define RCU_RTC_HXTAL_DIV54          CFG0_RTCDIV(54)                                /*!< RTCDIV clock select CK_HXTAL / 54 */
#define RCU_RTC_HXTAL_DIV55          CFG0_RTCDIV(55)                                /*!< RTCDIV clock select CK_HXTAL / 55 */
#define RCU_RTC_HXTAL_DIV56          CFG0_RTCDIV(56)                                /*!< RTCDIV clock select CK_HXTAL / 56 */
#define RCU_RTC_HXTAL_DIV57          CFG0_RTCDIV(57)                                /*!< RTCDIV clock select CK_HXTAL / 57 */
#define RCU_RTC_HXTAL_DIV58          CFG0_RTCDIV(58)                                /*!< RTCDIV clock select CK_HXTAL / 58 */
#define RCU_RTC_HXTAL_DIV59          CFG0_RTCDIV(59)                                /*!< RTCDIV clock select CK_HXTAL / 59 */
#define RCU_RTC_HXTAL_DIV60          CFG0_RTCDIV(60)                                /*!< RTCDIV clock select CK_HXTAL / 60 */
#define RCU_RTC_HXTAL_DIV61          CFG0_RTCDIV(61)                                /*!< RTCDIV clock select CK_HXTAL / 61 */
#define RCU_RTC_HXTAL_DIV62          CFG0_RTCDIV(62)                                /*!< RTCDIV clock select CK_HXTAL / 62 */
#define RCU_RTC_HXTAL_DIV63          CFG0_RTCDIV(63)                                /*!< RTCDIV clock select CK_HXTAL / 63 */

/* The CK_OUT0 divider */
#define CFG2_CKOUT0DIV(regval)       (BITS(0,3) & ((uint32_t)(regval) << 0U))
#define RCU_CKOUT0_DIV1              CFG2_CKOUT0DIV(1)                              /*!< CK_OUT0 is divided by 1 */
#define RCU_CKOUT0_DIV2              CFG2_CKOUT0DIV(2)                              /*!< CK_OUT0 is divided by 2 */
#define RCU_CKOUT0_DIV3              CFG2_CKOUT0DIV(3)                              /*!< CK_OUT0 is divided by 3 */
#define RCU_CKOUT0_DIV4              CFG2_CKOUT0DIV(4)                              /*!< CK_OUT0 is divided by 4 */
#define RCU_CKOUT0_DIV5              CFG2_CKOUT0DIV(5)                              /*!< CK_OUT0 is divided by 5 */
#define RCU_CKOUT0_DIV6              CFG2_CKOUT0DIV(6)                              /*!< CK_OUT0 is divided by 6 */
#define RCU_CKOUT0_DIV7              CFG2_CKOUT0DIV(7)                              /*!< CK_OUT0 is divided by 7 */
#define RCU_CKOUT0_DIV8              CFG2_CKOUT0DIV(8)                              /*!< CK_OUT0 is divided by 8 */
#define RCU_CKOUT0_DIV9              CFG2_CKOUT0DIV(9)                              /*!< CK_OUT0 is divided by 9 */
#define RCU_CKOUT0_DIV10             CFG2_CKOUT0DIV(10)                             /*!< CK_OUT0 is divided by 10 */
#define RCU_CKOUT0_DIV11             CFG2_CKOUT0DIV(11)                             /*!< CK_OUT0 is divided by 11 */
#define RCU_CKOUT0_DIV12             CFG2_CKOUT0DIV(12)                             /*!< CK_OUT0 is divided by 12 */
#define RCU_CKOUT0_DIV13             CFG2_CKOUT0DIV(13)                             /*!< CK_OUT0 is divided by 13 */
#define RCU_CKOUT0_DIV14             CFG2_CKOUT0DIV(14)                             /*!< CK_OUT0 is divided by 14 */
#define RCU_CKOUT0_DIV15             CFG2_CKOUT0DIV(15)                             /*!< CK_OUT0 is divided by 15 */

