wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rcu.h
/* USBHS prescaler factor */
#define USBCLKCTL_USBHSPSC(regval)        (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_USBHSPSC_DIV1                 USBCLKCTL_USBHSPSC(0)                     /*!< USBHS prescaler select CK_PLL1Q / 1 */
#define RCU_USBHSPSC_DIV2                 USBCLKCTL_USBHSPSC(1)                     /*!< USBHS prescaler select CK_PLL1Q / 2 */
#define RCU_USBHSPSC_DIV3                 USBCLKCTL_USBHSPSC(2)                     /*!< USBHS prescaler select CK_PLL1Q / 3 */
#define RCU_USBHSPSC_DIV4                 USBCLKCTL_USBHSPSC(3)                     /*!< USBHS prescaler select CK_PLL1Q / 4 */
#define RCU_USBHSPSC_DIV5                 USBCLKCTL_USBHSPSC(4)                     /*!< USBHS prescaler select CK_PLL1Q / 5 */
#define RCU_USBHSPSC_DIV6                 USBCLKCTL_USBHSPSC(5)                     /*!< USBHS prescaler select CK_PLL1Q / 6 */
#define RCU_USBHSPSC_DIV7                 USBCLKCTL_USBHSPSC(6)                     /*!< USBHS prescaler select CK_PLL1Q / 7 */
#define RCU_USBHSPSC_DIV8                 USBCLKCTL_USBHSPSC(7)                     /*!< USBHS prescaler select CK_PLL1Q / 8 */

/* USBHS 48MHz clock selection */
#define USBCLKCTL_USB48MSEL(regval)       (BITS(5,6) & ((uint32_t)(regval) << 5U))
#define RCU_USB48MSRC_PLL0R               USBCLKCTL_USB48MSEL(0)                    /*!< select PLL0R as USABHS 48MHz clock source */
#define RCU_USB48MSRC_PLLUSBHS            USBCLKCTL_USB48MSEL(1)                    /*!< select PLLUSBHS / USBHSDV as USABHS 48MHz clock source */
#define RCU_USB48MSRC_PLL1Q               USBCLKCTL_USB48MSEL(2)                    /*!< select PLL1Q / USBHSPSC as USABHS 48MHz clock source */
#define RCU_USB48MSRC_IRC48M              USBCLKCTL_USB48MSEL(3)                    /*!< select IRC48M as USABHS 48MHz clock source */

/* IRC64M clock frequency monitor configuration */
#define CKFMCFG0_IRC64MCKFMC(range)       (BITS(1,2) & ((uint32_t)(range) << 1U))
#define RCU_IRC64MCKFMC_5_PERCENT         CKFMCFG0_IRC64MCKFMC(0)                   /*!< the IRC64M clock frequency monitoring range is ��5% */
#define RCU_IRC64MCKFMC_10_PERCENT        CKFMCFG0_IRC64MCKFMC(1)                   /*!< the IRC64M clock frequency monitoring range is ��10% */
#define RCU_IRC64MCKFMC_15_PERCENT        CKFMCFG0_IRC64MCKFMC(2)                   /*!< the IRC64M clock frequency monitoring range is ��15% */
#define RCU_IRC64MCKFMC_20_PERCENT        CKFMCFG0_IRC64MCKFMC(3)                   /*!< the IRC64M clock frequency monitoring range is ��20% */

/* LPIRC4M clock frequency monitor configuration */
#define CKFMCFG0_LPIRC4MCKFMC(range)      (BITS(17,18) & ((uint32_t)(range) << 17U))
#define RCU_LPIRC4MCKFMC_5_PERCENT        CKFMCFG0_LPIRC4MCKFMC(0)                 /*!< the LPIRC4M clock frequency monitoring range is ��5% */
#define RCU_LPIRC4MCKFMC_10_PERCENT       CKFMCFG0_LPIRC4MCKFMC(1)                 /*!< the LPIRC4M clock frequency monitoring range is ��10% */
#define RCU_LPIRC4MCKFMC_15_PERCENT       CKFMCFG0_LPIRC4MCKFMC(2)                 /*!< the LPIRC4M clock frequency monitoring range is ��15% */
#define RCU_LPIRC4MCKFMC_20_PERCENT       CKFMCFG0_LPIRC4MCKFMC(3)                 /*!< the LPIRC4M clock frequency monitoring range is ��20% */

/* LXTAL start circuit control */
#define RCU_LXTAL_START_CIRCUIT_CLOSE     0x00000000U                              /*!< close the start circuit when LXTAL is ready */
#define RCU_LXTAL_START_CIRCUIT_HOLD      RCU_BDCTL_LXTALSTARTON                   /*!< hold the start circuit when LXTAL is ready */

/* DSI preceding stage clock source selection */
#define RCU_DSIPRESEL_IRC64MDIV           0x00000000U                              /*!< CK_IRC64MDIV selected as DSI preceding stage source clock */
#define RCU_DSIPRESEL_HXTAL               RCU_CFG1_DSIPRESEL                       /*!< CK_HXTAL selected as DSI preceding stage source clock */

/* DSI clock source division selection */
#define CFG3_DSIDIV(regval)               (BITS(6,9) & ((uint32_t)(regval) << 6U))
#define RCU_DSI_DIV1                      CFG3_DSIDIV(0)                           /*!< DSI clock division factor is 1 */
#define RCU_DSI_DIV2                      CFG3_DSIDIV(1)                           /*!< DSI clock division factor is 2 */
#define RCU_DSI_DIV3                      CFG3_DSIDIV(2)                           /*!< DSI clock division factor is 3 */
#define RCU_DSI_DIV4                      CFG3_DSIDIV(3)                           /*!< DSI clock division factor is 4 */
#define RCU_DSI_DIV5                      CFG3_DSIDIV(4)                           /*!< DSI clock division factor is 5 */
#define RCU_DSI_DIV6                      CFG3_DSIDIV(5)                           /*!< DSI clock division factor is 6 */
#define RCU_DSI_DIV7                      CFG3_DSIDIV(6)                           /*!< DSI clock division factor is 7 */
#define RCU_DSI_DIV8                      CFG3_DSIDIV(7)                           /*!< DSI clock division factor is 8 */
#define RCU_DSI_DIV9                      CFG3_DSIDIV(8)                           /*!< DSI clock division factor is 9 */
#define RCU_DSI_DIV10                     CFG3_DSIDIV(9)                           /*!< DSI clock division factor is 10 */
#define RCU_DSI_DIV11                     CFG3_DSIDIV(10)                          /*!< DSI clock division factor is 11 */
#define RCU_DSI_DIV12                     CFG3_DSIDIV(11)                          /*!< DSI clock division factor is 12 */
#define RCU_DSI_DIV13                     CFG3_DSIDIV(12)                          /*!< DSI clock division factor is 13 */
#define RCU_DSI_DIV14                     CFG3_DSIDIV(13)                          /*!< DSI clock division factor is 14 */
#define RCU_DSI_DIV15                     CFG3_DSIDIV(14)                          /*!< DSI clock division factor is 15 */
#define RCU_DSI_DIV16                     CFG3_DSIDIV(15)                          /*!< DSI clock division factor is 16 */

